app/controllers/analysis_controller.rb

SELECT * FROM "actors"
SELECT count(*) AS count_all FROM "actors"
SELECT count(*) AS count_all FROM "movies"
---
  def index
    # Tiny bit of usability sugar
    if Actor.count == 0 or Movie.count == 0

SELECT * FROM "actors" WHERE ("actors"."name" = 'test actor 2') LIMIT 1
---
  def show
    @actor_1 = Actor.find_by_name params[:actor_1_title]

DELETE FROM "movies" WHERE "id" = 1
DELETE FROM "actors" WHERE "id" = 1
---
  def destroy
    flash[:message] = "Destroyed all database entries"
    Movie.destroy_all
    Actor.destroy_all